export const ConfigurationBack: InexpensiveItem = [
    {
        id: 1,
        text1: "Конфигуратор ПК , собрать компьютер онлайн с проверкой совместимости",
        title: "Конфигуратор ПК",
        text: "Позволяет собрать компьютер, о котором вы мечтали. Изменить\n" +
            "комплектацию представленных на сайте сборок, узнать цену\n" +
            "онлайн, сравнить характеристики. Оформить заказ и получить\n" +
            "готовый ПК с абсолютно бесплатной профессиональной сборкой.\n" +
            "Продвинутый онлайн-сервис для модификации ПК",

    },
    {
        id: 2,
        title: "Онлайн конструктор для сборки компьютеров",
        text1: "Сборка компьютеров онлайн - под\n" +
            "любые задачи по выгодным ценам.\n" +
            "Умный конструктор ПК.",
        text2: "Онлайн проверка совместимости\n" +
            "комплектующих, алгоритм\n" +
            "интеллектуального подбора",
        text3: "Собрать ПК - игровой, домашний,\n" +
            "офисный, для работы с графикой.\n" +
            "Гибкая модификация ПК.",
        img: "/img/basa.png",
    },
    {
        id: 3,
        img: "/img/amd-back.png",
    }
]
export const AmdBackend: InexpensiveItem = [
    {
        id: 1,
        text1: " Мощные ПК на базе AMD Ryzen 9 (АМД)",
        title: "Мощные ПК на базе AMD Ryzen 9 (АМД)",
        text: "Непревзойденная многозадачность в широком диапазоне частот.\n" +
            "Мощный разгонный потенциал, высокий кпд процессора и\n" +
            "экономный расход электроэнергии. Правильный баланс цены и\n" +
            "производительности в компьютерах АМД для игр. Больше ядер,\n" +
            "потоков и более быстрый интерфейс PCIe 4.0 в сравнении с Intel."
    },
    {
        id: 2,
        title: "Компьютеры AMD для профессионалов и требовательных геймеров",
        text1: "Игровые компьютеры на базе AMD\n" +
            "Ryzen Threadripper, уникальная\n" +
            "мощь и производительность",
        text2: "Высокий разгонный потенциал,\n" +
            "стабильность в работе, железный\n" +
            "аргумент для серьезных задач",
        text3: "Даже героям требуется мощное\n" +
            "железо, сборки ПК на процессоре\n" +
            "АМД (Advanced Micro Devices)",
        img: "/img/amd-back.png"

    },

    {
        id: 3,
        img: "/img/amd-img1.png",
        title: "Игровые компьютеры на базе AMD",
        text1: "Энтузиасты постоянно спорят о преимуществах Intel и AMD. Конечно, компания Intel известна на компьютерном рынке высокой надежностью, внедрением инновационных технологий и энергоэффективностью. Однако Advanced Micro Devices есть чем ответить.",
        img2: "/img/amd-img2.png",

        title2: " Основные аргументы от «передовых микроустройств»",
        text2: "Главное преимущество продукции компании – грамотная ценовая политика. Компьютер с АМД райзен стоит в полтора раза дешевле конкурента. Для многих геймеров с ограниченным бюджетом достаточно серьезный аргумент. PC AMD от «красных» опережают Intel по производительности встроенной в них видеокарты.",
        text3: "Особого внимания заслуживает технология Cool'n'Quiet, разработанная специалистами компании. Реализована во всех \"камнях\" семейства K8 и выше. Благодаря этой системе, мощность процессора может регулироваться, в зависимости от поставленных задач.",

        title3: "Amin store предлагает",

        text4: "В разделе Компьютеры с AMD RYZEN представлены мощные ПК с АМД на любой вкус и достаток. Самые бюджетный обладает огромным потенциалом. Вооружены – лучшей видеокарт среднего ценового диапазона RADEON RX580 8 Gb. Играйте и наслаждайтесь графикой.",
        text5: " Самым амбициозным игрокам, предлагаем «навороченные» модели: крутой монстр EDELWEISS LUCIFER с флагманским процессором Threadripper 2990WX имеет 32 ядра, 64 потока и поддержку четырехканальной памяти стандарта DDR4. Разработчики цифрового контента тоже будут довольны, не секрет что \"красные\" сильно дружат с \"математикой\". ",

        text6: "Игровые ПК 2020 на AMD порадует вас интеллектом, высокой вычислительной мощью, стильным внешним видом. Корпуса привлекают внимание боевым дизайном и настраивают на победу в каждой игре. Если вы хотите добавить авторский штрих в конструкцию любой сборки на AMD RYZEN, можете воспользоваться конфигуратором. Менеджеры компании с удовольствием ответят на се возникшие вопросы.",


    },
]

export const GameBack: InexpensiveItem = [
    {
        id: 1,
        text1: "Мощные игровые компьютеры",
        title: "Мощные игровые компьютеры",
        text: "Крутые компы для геймеров и киберспортсменов. Мощные ПК\n" +
            "2023 года, надежные компоненты, брендовое и самое быстрое\n" +
            "компьютерное железо. Качественная графика GEFORCE RTX,\n" +
            "запредельный FPS, идеальный геймплей. Системные блоки с\n" +
            "повышенной производительностью - лучшие ПК для игр!",
    },
    {
        id: 2,
        title: "Продвинутая серия - игровые компьютеры",
        text1: "Мощные системные блоки,\n" +
            "высокая скорость работы в играх и\n" +
            "графических программах",
        text2: "Возможность играть на\n" +
            "максимальных настройках\n" +
            "графики, в проекты AAA",
        text3: "Качественные компаненты,\n" +
            "классный дизайн, крутые игровые\n" +
            "ПК EDELWEISS",
        img: "/img/game-back.png"
    },
    {
        id: 3,
        img: "/img/game-back1.png",
        title: "ПК для игр и работы",
        text1: "Игровые компьютеры в ценовом диапазоне от 100 тысяч рублей пользуются наибольшей популярностью у наших\n" +
            "клиентов. Их технические характеристики позволяют воплощать в реальность самые смелые идеи. Как правило,\n" +
            "системные блоки из продвинутой серии имеют в своем активе:",
        text2: "мощный процессор – AMD Ryzen 7, Intel Core i7 или Intel Core i9;" +
            "крутую графику Nvidia – GЕFORCE RTX 3070 или GЕFORCE RTX 3080; " +
            "жесткий диск – от 2 до 8 Тб Seagate, WDC Black, Gold" +
            "быстрые SSD диски формата NVME M.2 Samsung, Gigabyte",
        img2: "/img/game-back2.png",
        text3: "Представленные модели отличает боевой, даже агрессивный дизайн. Корпус и RGB подсветка плюс эффективная\n" +
            "система вентиляции выполнены стильно, уникально, они ненавязчиво подчеркивают высокий статус крутого\n" +
            "геймера, а как иначе это же современные Gaming PC.",
        text4: "По-настоящему крутой комп должен отвечать ряду требований, среди которых:",
        text5: " возможность запуска любого современного проекта класса AAA" +
            "комфортный FPS, в том числе в разрешении 4K (более 100 FPS в FHD и на уровне 60‑80 в 4K)" +
            "использование последних технологических решений (трассировки лучей реалтайм, высокое количество ядер CPU и GPU, RGB" +
            "подсветка, DLSS рендеринг на базе ИИ, процедурная генерация игрового мира)" +
            "полное отсутствие микрофонов и посадки частоты кадров, мешающих плавному геймплею",
        text6: " Чтобы системник соответствовал выше перечисленным параметрам, он должен быть собран из лучших брендовых комплектующих. Соблюдая данное условия мы получим мощный игровой ПК с приставкой gaming который не только «потянет» любую современную игру, но и будет актуален в течение ближайших 3 – 4 лет.",
        img3: "/img/game-back3.png",
        text7: " Покупая классный игровой компьютер в крутой комплектации будьте уверены мы предложим Вам:",
        text8: "конкурентные цены и удобную для Вас форму оплаты;" +
            "качественную сборку высококвалифицированными специалистами;" +
            "обязательное сервисное и гарантийное обслуживание;" +
            "установку и настройку необходимого ПО;" +
            "создавать и комплектовать собственные конфигурации;" +
            "возможность приобрести компьютер в рассрочку или кредит;",
        text9: "Компетентную онлайн поддержку по телефону, при необходимости удаленный мониторинг через TeamViewer или другой программный комплекс. Быструю реализацию заказа с соблюдением всех технологических регламентов. Продажу и доставку в любой регион РФ. Самым требовательным клиентам мы предлагаем посетить ",

        text10: "категорию экстремальные ПК.",
        title2: " Больше чем мощный игровой ПК",

        title3: "Admin Store гарантирует"
    }
]
export const PowerfulBack: InexpensiveItem = [
    {
        id: 1,
        text1: "Сверхмощные компьютеры",
        title: "Сверхмощные компьютеры",
        text: "Топовые ПК - самое совершенное и дорогое в мире железо.\n" +
            "Оптимизированы под разрешение экрана 4K. Премиальные\n" +
            "компьютеры для профессионалов, энтузиастов и создателей\n" +
            "качественного цифрового контента.",
    },
    {
        id: 2,
        title: "Экстремальная серия - мощнейшие ПК",
        text1: "Высокопроизводительные системы\n" +
            "для работы с максимально\n" +
            "возможной эффективностью",
        text2: "Бескомпромиссные решения для\n" +
            "экстремалов с колоссальной\n" +
            "вычислительной скоростью",
        text3: "Топовые ПК для гейминга 4K+ с\n" +
            "имбалансной конфигурацией и\n" +
            "фантастическим FPS",
        img: "/img/power.png",
    },
    {
        id: 3,
        img: "/img/rtx3090-x.jpg.png",
        title: " Титаны компьютерного мира",
        text1: "Современные игры, фото и графические редакторы требует от ЭВМ колоссального вычислительного\n" +
            "ресурса. Серия экстремальных ПК в данном каталоге – это системные блоки которые обладает техническим\n" +
            "заделом на несколько лет вперед.",
        text2: "Подобные устройства способны решить даже самые невообразимые потребительские задачи сегодня и с\n" +
            "таким же успехом будут решать их завтра. Если развитие компьютерной индустрии и не достигло наивысшей\n" +
            "точки, то перешло на качественно новый уровень. ",
        text3: " Принципиальная позиция современного пользователя выглядит следующим образом. Мир быстро меняется,\n" +
            "системные требования ко многим новинкам растут быстрее их выхода, поэтому для идеальной рабочей среды\n" +
            "нужны высокопроизводительные компьютеры Hi End класса.",
        text4: " Компания EDELWEISS в своих ПК используем самые высокотехнологичные решения в мире IT. Мы постоянно\n" +
            "следим за основными тенденциями мирового компьютерного рынка и предлагаем своим клиентам только\n" +
            "лучшие образцы,на основе самых топовых компонентов и инновационных решений.",
        text5: "Купить топовый ПК – это получить высочайшую производительность и слаженную работу всех\n" +
            "узлов компьютера, систему способную решать сложнейшие задачи.",
        img2: "/img/asusg.jpg.png",
        title2: "Процессоры и видеокарты - CPU и GPU",
        text6: "Порог вхождения для центрального процессора - тактовая частота в 5000 МГц. Новое поколения микросхем\n" +
            "от Intel Core i9-10900K и AMD RYZEN 5900 обладают уникальным быстродействием и высокой оптимизацией.\n" +
            "С таким CPU запуск и работа в сложных инженерных программах будет максимально комфортной.",
        text7: "Другим важнейшим компонентом суперкомпьютера является видеокарта GЕFORCE RTX 3090 24 Гб. В тандеме\n" +
            "intel i9 или AMD Ryzen 9 эти графические адаптеры просто творят чудеса.",
        text8: "Картинка становится реалистичной на все сто, появляется возможность без тормозов, очень плавно и\n" +
            "качественно вести стримы параллельно играя в разрешении 4К+.",
        img3: "/img/div.seo__end.png",
        title3: "Продуманный интерьер премиальных ПК",
        text10: "Мы никогда не забываем и о внешнем виде системных блоков, ведь это топовые компьютеры в дорогом\n" +
            "исполнении- монстры цифрового мира! Все они оригинальны, имеют современный и, чаще всего, «боевой»\n" +
            "дизайн, который настраивает на победу.",
        text9: "Оперативная память стартует от 32 лучше 64 Гб, эффективная система охлаждения NZXT Kraken X73 Liquid\n" +
            "Cooler,воздушка Be Quiet Dark Rock Pro 4 или Noctua NH-D15, а лучше кастомный набор СВО EKWB, материнские\n" +
            "платы типа ASUS ROG GAMING или AORUS MASTER от GIGABYTE c чипсетом X299 / Z490, самые скоростные SSD\n" +
            "диски,сертифицированные блоки питания класса gold и platinum прилагаются.",
        text11: "Купить дорогой эксклюзивный компьютер вам помогут специалисты компании EDELWEISS. В магазине есть\n" +
            "достаточное количество крутейших ПК, однако мы прекрасно понимаем желание каждого геймера иметь в\n" +
            "своем арсенале уникальный во всех отношениях суперкомпьютер. Поэтому каждый желающий может\n" +
            "персонифицировать свою сборку воспользовавшись конфигуратором пк."
    }

]
export const InexpensiveBack: InexpensiveItem = [
    {
        id: 1,
        text1: "Недорогие игровые компьютеры",
        title: "Недорогие игровые компьютеры",
        text: "ПК для начинающих геймеров с ограниченным бюджетом.\n" +
            "Компьютеры оптимизированы для игр, учёбы и работы.\n" +
            "Достаточная производительность по низкой цене. Готовые\n" +
            "системные блоки с фирменной гарантией производителя.\n" +
            "Качественно и рационально."
    },
    {
        title: "Оптимальная серия - доступные игровые ПК",
        text1: "Бюджетные системные блоки,\n" +
            "низкая цена - разумный расход\n" +
            "средств",
        text2: " Современный дизайн \n" +
            "и качественная сборка,\n" +
            "справедливая стоимость",
        text3: "Возможность купить дёшево\n" +
            "компьютер - универсальное\n" +
            "решение для дома и офиса",
        img: "/img/basa-2.png"
    },
    {
        id: 3,
        title: "ПК недорого - это реально и доступно",
        text1: " Средняя стоимость хорошего домашнего ПК стартует от 70 000 ₽. Как быть в случае, если потратить такую сумму нет возможности, а пройти последние тайтлы хочется? Выход – купить недорогой компьютер по цене 30 000 рублей или чуть выше.",
        text2: "Мы предлагаем доступные системные блоки только из новых комплектующих. Это обеспечивает продолжительную стабильную работу компьютера. Каждая сборка сбалансирована. К процессору подобрана производительная видеокарта из бюджетного ценового сегмента.",
        text3: " Благодаря этому машина сможет запустить любую новую игру с настройками выше среднего, доставит радость своей практичностью и рациональным расходованием средств.",
        title2: "Продажа бюджетных компьютеров для дома и офиса",
        text4: "В EDELWEISS можно купить приличную станцию по вполне доступной цене. Каждая сборка продумана\n" +
            "специалистами и дает возможность глубоко погружаться в виртуальный мир. Даже самый бюджетный вариант EDELWEISS CYBORG обещает новичкам комфортное участие в Dota 2, Fortnite, League of Legends, CS:GO и других популярных проектах.",
        text5: "Исходя из этого, вы можете купить дёшево системный блок и полноценно работать за своим новым компьютером  или сделать из него недорогое игровое решение с возможностью дальнейшей модернизации. Такая покупка обойдется совсем недорого и доставит радость своей универсальностью.",
        img: "/img/InexpensiveBack-back.png",
    }
];

// ---------------footer tabs face backend-----------------------


export const Accessories = [];


export const InstallmentsBack: FooterTabs = [
    {
        id: 1,
        text1: "Игровые ПК в кредит и рассрочку",
        title: "Игровые ПК в кредит и рассрочку",
        text: "Играй и работай сейчас, деньги потом. Оформление кредита или рассрочку онлайн. Вы можете " +
            "оформить покупку с пониженной процентной ставкой через бесплатный сервис Happylend. Партнеры сервиса: Альфа-Банк, Банк Восточный, Тинькофф, Райффайзен, Русский стандарт, Почта банк, и др."
    },
    {
        title: "Компьютеры в кредит и рассрочку ",
        text1: "Системные блоки в кредит от 2 до 36 месяцев," +
            " с возможностью досрочного погашения",
        text2: " Без первоначального взноса для физических лиц, рассрочка на 6 месяцев",
        text3: "Купи настоящий игровой компьютер в кредит -играй сейчас плати потом",
        img: "/img/credit-photo.png"
    },
];

export const ExtremeSeriesBack: FooterTabs = [
    {
        id: 1,
        text1: "Сверхмощные компьютеры",
        title: "Сверхмощные компьютеры",
        text: "Топовые ПК - самое совершенное и дорогое в мире железо. Оптимизированы под разрешение экрана 4K. Премиальные компьютеры для профессионалов, энтузиастов и создателей качественного цифрового контента. "
    },
    {
        title: "Экстремальная серия - мощнейшие ПК",
        text1: "Высокопроизводительные системы для работы с максимально возможной эффективностью",
        text2: " Бескомпромиссные решения для экстремалов с колоссальной вычислительной скоростью",
        text3: "Топовые ПК для гейминга 4K+ с имбалансной конфигурацией и фантастическим FPS",
        img: "/img/power.png"
    },
];


// ---------------------------------------------------------

type FooterTabs = [
    {
        id: number,
        text1: string,
        title: string,
        text: string
    },
    {
        title: string,
        text1: string,
        text2: string,
        text3: string,
        img: string
    },
]


type InexpensiveItem = [{
    id?: number;
    text1: string;
    title: string;
    text: string;
},
    {
        id?: number;
        title: string;
        text1: string;
        text2: string;
        text3: string;
        img: string

    },
    {
        id?: number;
        title?: string;

        text1?: string;
        text2?: string;
        text3?: string;
        title2?: string;
        text4?: string;
        text5?: string;
        text6?: string;
        text7?: string;
        text8?: string;
        text9?: string;
        text10?: string;
        img?: string
        img2?: string
        img3?: string
        text11?: string
        title3?: string

    }
]

export const basketBack: basket = [
    {
        title: "Корзина",
        text1: " Посмотрите предложения на главной странице или перейдите в конфигуратор ПК",
        text2: "",
        text3: "",
    }
]
type basket = [{
    title: string;
    text1: string;
    text2: string;
    text3: string;
}]
export const KomputerBack: KomputerBack = [
    {
        id: 1,
        text1: "Процессор",
        text2: "Охлаждение",
        text3: "Материнская плата",
        text4: "Оперативная",
        text5: "Видеокарта",
        text6: "Жёсткий диск",
        text7: "SSD диск 1",
        text8: "SSD диск 2",
        text9: "Корпус",
        text10: "Блок питания",
        text11: "Wi-Fi адаптер",
        text12: "Звуковая карта",
        text13: "Операционная система",
        text14: "Мышь",
        text15: "Клавиатура",
        text16: "Монитор",
        text17: "Гарнитура",


    },
    {
        id: 2,
        text1: "Процессор",
        text2: "Охлаждение",
        text3: "Материнская плата",
        text4: "Оперативная",
        text5: "Видеокарта",
        text6: "Жёсткий диск",
        text7: "SSD диск 1",
        text8: "SSD диск 2",
        text9: "Корпус",
        text10: "Блок питания",
        text11: "Wi-Fi адаптер",
        text12: "Звуковая карта",
        text13: "Операционная система",
        text14: "Мышь",
        text15: "Клавиатура",
        text16: "Монитор",
        text17: "Гарнитура",


    },
];


type KomputerBack = [{
    id?: number;
    text1?: string;
    text2?: string;
    text3?: string;
    title2?: string;
    text4?: string;
    text5?: string;
    text6?: string;
    text7?: string;
    text8?: string;
    text9?: string;
    text10?: string;
    text11?: string;
    text12?: string;
    text13?: string;
    text14?: string;
    text15?: string;
    text16?: string;
    text17?: string;


},
    {
        id?: number;
        text1?: string;
        text2?: string;
        text3?: string;
        title2?: string;
        text4?: string;
        text5?: string;
        text6?: string;
        text7?: string;
        text8?: string;
        text9?: string;
        text10?: string;
        text11?: string;
        text12?: string;
        text13?: string;
        text14?: string;
        text15?: string;
        text16?: string;
        text17?: string;


    },
]
