import "./index.scss"

export const Section4Module = () => {
    return (
        <div className="section4">
            <h2>Нашим клиентам</h2>
            <div className="section-block">
                <div className="section4-block-first">
                    <div className="block1">
                        <img src="/img/01.png" alt="" />
                        <h2>Профессиональная сборка ПК</h2>
                        <h3> Качественная сборка компьютеров и индивидуальная
                            настройка от инженеров компании EDELWEISS.
                            Моддинг полная кастомизация системных блоков.
                            Кабель менеджмент, персонификация ПК.</h3>
                    </div>
                    <div className="block1">
                        <img src="/img/02.png" alt="" />
                        <h2>Профессиональная сборка ПК</h2>
                        <h3> Качественная сборка компьютеров и индивидуальная
                            настройка от инженеров компании EDELWEISS.
                            Моддинг полная кастомизация системных блоков.
                            Кабель менеджмент, персонификация ПК.</h3>
                    </div>
                    <div className="block1">
                        <img src="/img/03.png" alt="" />
                        <h2>Профессиональная сборка ПК</h2>
                        <h3> Качественная сборка компьютеров и индивидуальная
                            настройка от инженеров компании EDELWEISS.
                            Моддинг полная кастомизация системных блоков.
                            Кабель менеджмент, персонификация ПК.</h3>
                    </div>
                    <div className="block1">
                        <img src="/img/04.png" alt="" />
                        <h2>Профессиональная сборка ПК</h2>
                        <h3> Качественная сборка компьютеров и индивидуальная
                            настройка от инженеров компании EDELWEISS.
                            Моддинг полная кастомизация системных блоков.
                            Кабель менеджмент, персонификация ПК.</h3>
                    </div>
                </div>
                <div className="section4-block-second">
                    <img src="/img/lapton.png" alt="" />
                    <h4>Вам остается только подключить
                        компьютер к питанию и монитору.
                        Приятного вам отдыха!</h4>
                    <h5>Команда Amin store</h5>
                </div>

            </div>

        </div>
    );
};
