import "./index.scss"

export const Section5Module = () => {
    return (
        <div className="section5">
            <div className="section5-inside">
                <div className="section5-block-first">
                    <h1>Важно! Сборка компьютера бесплатная.</h1>
                    <h4> Конфигуратор ПК — легкий способ собрать компьютер онлайн с проверкой физической совместимости <br />
                        комплектующих.</h4>
                    <h4>Начнем комплектовать. Добавляем первый элемент - центральный процессор (CPU). При выборе компонентов <br />
                        происходит визуализация внешнего вида устанавливаемых узлов. Цена рассчитывается автоматически в онлайн <br />
                        режиме, последовательно формируя стоимость готового ПК.</h4>
                    <h4> Программа конструктор за пару кликов помогает собрать и купить системный блок с нуля, присваивает <br />
                        идентификационный номер сборки, сохраняет ссылку. При необходимости распечатает сохраненную конфигурацию. <br />
                        Есть опция узнать мнение эксперта, воспользовавшись формой обратной связи.</h4>
                    <h2>Используйте лучшие компоненты</h2>
                    <h4>Собирать компьютер увлекательный процесс. Доступны – топовые видеокарты GEFORCE RTX, процессоры Intel и <br />
                        AMD последнего поколения, оперативная память с пассивным радиаторным охлаждением и RGB подсветкой, <br />
                        скоростные SSD накопители, плюс емкие HDD диски.</h4>
                    <h4>Выбирайте материнские платы Asus Msi Gigabyte, просторные корпуса на алюминиевых шасси, блоки питания <br />
                        Corsair, Thermaltake, Seasonic. Наш конструктор умеет решать трудные задачи. Позволит собрать
                        <span> игровой <br />
                            компьютер</span>
                        , производительную графическую станцию, машину для профессиональной оцифровки звука и видео.</h4>
                    <h4>
                        Когда вы сформировали конфигурацию ПК, нажмите кнопку "оформить заказ". Заполните стандартную форму, затем <br />
                        Вам на почту придет письмо и смс с подтверждением и содержанием заказа. Менеджеры магазина EDELWEISS <br />
                        свяжутся с Вами, ответят на вопросы и договорятся о времени и условиях доставки или самовывоза. <br />
                    </h4>
                </div>
                <div className="section5-block-second">
                    <img src="/img/игра%20комп.jpg" alt="" />
                </div>
            </div>

        </div>
    );
};
